src/Catalogs/ar_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Диалоги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Якорь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_LLMПровайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_БезАгента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПользовательUUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Создан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Обновлён</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПоследнийЗапуск</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Предмет</Name>					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПредставлениеПредмета</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ВидДиалога</Name>					<Type>
						<v8:Type>cfg:EnumRef.ar_ВидыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Состояние</Name>					<Type>
						<v8:Type>cfg:EnumRef.ar_СостоянияДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Запуск</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Инициатор</Name>					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ОткрытыйВопрос</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ДатаВопроса</Name>					<Comment/><Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ОтветитьДо</Name>					<Comment/><Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ar_ВыбранныеИнструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ar_Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Пользователь</Name>							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Основание</Name>							<Type>
								<v8:Type>cfg:EnumRef.ar_ОснованияУчастияВДиалоге</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_АдресПочты</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ar_СообщенияДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_СообщенияДиалога</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Роль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Запуск</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ИдентификаторВопроса</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Момент</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_ВидыСообщенийДиалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ВариантыОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветВыбранИзВариантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжидаетОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_Диалог</Name>					<Type>
						<v8:Type>cfg:CatalogRef.ar_Диалоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ar_Якорь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ar_Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ar_ВидыДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_ВидыДиалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Чат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВопросыАгента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ar_СостоянияДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_СостоянияДиалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершён</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Истёк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ar_ВидыСообщенийДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_ВидыСообщенийДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вопрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Служебное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ar_Диалоги/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма списка справочника ar_Диалоги (agentrunner-26 п.16): первыми -
// «Ожидает ответа», затем по убыванию даты; параметры открытия Предмет и
// ТолькоМоиВопросы; под списком - лента и ввод текущей строки (через ядро).
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь",
		ПараметрыСеанса.ТекущийПользователь);

	Если Параметры.Свойство("ТолькоМоиВопросы")
		И Параметры.ТолькоМоиВопросы = Истина Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТолькоМоиВопросы", Истина);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ТолькоМоиВопросы", Ложь);
	КонецЕсли;

	Если Параметры.Свойство("Предмет") И ЗначениеЗаполнено(Параметры.Предмет) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ar_Предмет");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Параметры.Предмет;
		ЭлементОтбора.Использование  = Истина;
	КонецЕсли;

	ЗагрузитьЛентуТекущейСтроки();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивацииСтроки(Элемент)

	ПодключитьОбработчикОжидания("ОбновитьЛентуТекущейСтроки", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЛентуТекущейСтроки()

	ОбновитьЛентуНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьСообщение(Команда)

	ТекущийДиалог = Элементы.Список.ТекущаяСтрока;
	Если Не ЗначениеЗаполнено(ТекущийДиалог) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Выберите диалог в списке.'; en='Select a dialog in the list.'"));
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(ТекстОтвета) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Введите текст сообщения.'; en='Enter the message text.'"));
		Возврат;
	КонецЕсли;

	ОтправитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЛентуНаСервере()

	ЗагрузитьЛентуТекущейСтроки();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЛентуТекущейСтроки()

	Если Не ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		ЛентаHTML = "";
		Элементы.ГруппаОтвета.Доступность = Ложь;
		Возврат;
	КонецЕсли;

	СсылкаДиалога = Элементы.Список.ТекущаяСтрока;
	ЛентаHTML = ar_ДиалогиСервер.РазметкаЛентыHTML(СсылкаДиалога);

	ШапкаДиалога = ar_ДиалогиСервер.ШапкаДиалога(СсылкаДиалога);
	Если ШапкаДиалога.ВидДиалога = Перечисления.ar_ВидыДиалогов.Чат Тогда
		Элементы.ГруппаОтвета.Заголовок = НСтр("ru='Чат ведётся в консоли агентов';
			|en='The chat is handled in the agent console'");
		Элементы.ГруппаОтвета.Доступность = Ложь;
	ИначеЕсли ШапкаДиалога.Состояние = Перечисления.ar_СостоянияДиалогов.ВРаботе Тогда
		Элементы.ГруппаОтвета.Заголовок = НСтр("ru='Агент работает, дождитесь ответа';
			|en='The agent is working, please wait for the reply'");
		Элементы.ГруппаОтвета.Доступность = Ложь;
	Иначе
		Элементы.ГруппаОтвета.Заголовок = НСтр("ru='Ответ'; en='Reply'");
		Элементы.ГруппаОтвета.Доступность = Истина;

		// Варианты открытого вопроса - в список выбора поля ввода.
		Элементы.ТекстОтвета.СписокВыбора.Очистить();
		Если ШапкаДиалога.Состояние = Перечисления.ar_СостоянияДиалогов.ОжидаетОтвета Тогда
			Варианты = ВариантыОткрытогоВопроса(СсылкаДиалога);
			Для Каждого Вариант Из Варианты Цикл
				Элементы.ТекстОтвета.СписокВыбора.Добавить(Вариант);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()

	СсылкаДиалога = Элементы.Список.ТекущаяСтрока;
	Если Не ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат;
	КонецЕсли;

	Итог = ar_ДиалогиСервер.ОтправитьСообщение(СсылкаДиалога, ТекстОтвета);

	Если Не ПустаяСтрока(Итог.Сообщение) Тогда
		ПоказатьПредупреждение(, Итог.Сообщение);
	КонецЕсли;

	Если Итог.Успех Тогда
		ТекстОтвета = "";
	КонецЕсли;

	Элементы.Список.Обновить();
	ЗагрузитьЛентуТекущейСтроки();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВариантыОткрытогоВопроса(Знач Диалог)

	// Варианты из последнего сообщения «Вопрос» (ресурс ar_ВариантыОтвета, JSON).
	Варианты = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сообщения.ar_ВариантыОтвета КАК ВариантыОтвета
		|ИЗ
		|	РегистрСведений.ar_СообщенияДиалога КАК Сообщения
		|ГДЕ
		|	Сообщения.ar_Диалог = &Диалог
		|	И Сообщения.ar_ВидСообщения = &ВидСообщения
		|УПОРЯДОЧИТЬ ПО
		|	Сообщения.ar_Номер УБЫВ";
	Запрос.УстановитьПараметр("Диалог", Диалог);
	Запрос.УстановитьПараметр("ВидСообщения", Перечисления.ar_ВидыСообщенийДиалога.Вопрос);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Или Не ЗначениеЗаполнено(Выборка.ВариантыОтвета) Тогда
		Возврат Варианты;
	КонецЕсли;

	Попытка
		Разобранные = ar_JSON.ИзJSON(Выборка.ВариантыОтвета);
	Исключение
		Возврат Варианты;
	КонецПопытки;

	Если ТипЗнч(Разобранные) = Тип("Массив") Тогда
		Для Каждого Вариант Из Разобранные Цикл
			Если ТипЗнч(Вариант) = Тип("Строка") И Не ПустаяСтрока(Вариант) Тогда
				Варианты.Добавить(Вариант);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Варианты;

КонецФункции

#КонецОбласти
